[
  {
    "path": "posts/2022-02-20-creating-a-website-with-distill/",
    "title": "Creating a website with {distill}",
    "description": "Useful resources for creating your first {distill} site.",
    "author": [
      {
        "name": "Jeppe Vierø",
        "url": "https://twitter.com/jvieroe"
      }
    ],
    "date": "2022-02-20",
    "categories": [
      "distill",
      "R",
      "Tutorial"
    ],
    "contents": "\n\nContents\nPromises kept\nDistill 101\nCustomizing your theme\nOther features\n\nGood luck!\n\nPromises kept\nWhen I launched this website, I promised two things:\nthat I wouldn’t write yet another guide to creating and publishing a website using the {distill} package for R\nbut instead share some of the existing resources that I had found useful when creating this very website – my first site ever (and, by implication, my first site created in R)\nIn this post I will keep the second promise.\nAs a general resource, The Distillery’s guide ‘Creating a Website’ contains everything you need every step of the way. Nevertheless, below I provide links to some of the other stuff that helped me.\n\n{distill}\nDistill 101\nPrior to launching this site, I had no experiencing with web management and creating a site from scratch. This is one of the reasons why {distill} had such a strong appeal: it seemed like a simple and clean framework that would allow me to do everything in R.\nTo get me started, I found Andreas Handel’s ‘Create a GitHub website with distill in less than 30 minutes’ incredibly helpful\nThomas Mock’s ‘Building a blog with distill’ also provides a lot of useful tips and tricks\n\nCustomizing your theme\nAs someone new to CSS, one of the things that drew me towards {distill} was the fact that it’s an opinionated framework. This means that there is less customization that you can do. It also means, however, that there is less customization you have to do before you have a nice-looking site.\nThe Distillery’s Showcase section is an amazing resource. There are so many cool (and cool-looking) sites on there and their open source code means that you can allow yourself to be inspired by their theme – and, more importantly, how they arrived at it!\nI still don’t really know CSS but I managed to piggyback from some great existing sites, including those of Harry Fisher, Shannon Pileggi, PhD, and Etienne Bacher\n\nOther features\nIf you want help to set up giscus, a free, open-source commenting system for blogs/websites that are built using the GitHub API, look no further than Joel Nitta’s tutorial ‘Enable giscus in Distill’\nI used Thomas Mock’s guide ‘Including and meta tagging extra content in a distill blog’, The Distillery’s guide on ‘Article Metadata’ , and this Twitter thread to help me set up and adjust the preview appearance of my site when sharing links on Twitter, GitHub etc.\n\nGood luck!\nI hope these links will prove useful in case you decide to give {distill} a chance! Also, make sure to check out The Distillery’s continuously updated Tips & Tricks site.\n\n\nEnjoy coding your new website!\n\n\n\n\n",
    "preview": "posts/2022-02-20-creating-a-website-with-distill/distill_small.png",
    "last_modified": "2022-02-20T16:30:19+01:00",
    "input_file": {},
    "preview_width": 1300,
    "preview_height": 1501
  },
  {
    "path": "posts/2022-01-30-welcome/",
    "title": "My very first blog post",
    "description": "A trial blog post: Take-off!",
    "author": [
      {
        "name": "Jeppe Vierø",
        "url": "https://twitter.com/jvieroe"
      }
    ],
    "date": "2022-01-30",
    "categories": [
      "distill",
      "welcome"
    ],
    "contents": "\nPhoto by SpaceX on UnsplashThere is nothing of real interest here. This post only exists as a test of the {distill} package’s blog features as well as, more importantly, my ability to use them.\nTake-off!\n\n\n\n\n\n\n\n\n",
    "preview": "posts/2022-01-30-welcome/spacex-OHOU-5UVIYQ-unsplash.jpg",
    "last_modified": "2022-02-18T18:54:48+01:00",
    "input_file": {}
  }
]
